
# 永远不要损失本金

# 永远不要上杠杆

# 只要做好几件事，就可正收益
### 拿得住，买的不贵，资产配置，各个种类配置不要超过20%， 低卖高抛，不要all in 

# 无法预测市场，不要试图买在最低，卖在最高； 一次两次或许对，但永远无法每次对
# 不预测，只应对，
# 最好是一份一份的买，因为无法预测市场走向，这样才可总成本低
# 此处有一个失败教训是在招商上买基金时，最初一次2000，后面500进，导致最开始成本高，后面市场低时无法快速拉低成本。

# 涨跌都舒服
# 投资是因为有机会，而不是因为手里有钱

# 2022.4.6  
# 1, 不要被表象迷惑双眼
#    基金投资最重要的是份额，并不是在基金界面所显示的金额，
#    比如当你买入三次同样金额，份额不同，然后卖出第三次同等份额，则现在基金购买界面不是前两次金额
# 2, 每次购买金额最好一致
#    最近发现一个毛病，在购买基金时，前两次大额买入(比如 2K)，后面市场下跌时会小额买入(500), 
#    这种行为会导致在市场下跌时无法有效拉低成本，因为前两次金额多，高位站岗，后面谨慎买入少


# 2022.4.29
# 在4.25市场大跌，当天买入 1.5w
# 为什么下跌了不敢加倍买呢 ？ 
# 在4.25当天是知道市场低位，我很明确的知道了，但是还是基本每个基金还是只买了一份，分析原因：
    1，不想在一个位置大量买入，考虑的是要逐步买入，市场无法预测，如果还有底呢，然后没想到的是26号微涨，27号大涨
    2，时间空间，对于这次熊市考虑的是拉开时间空间，每间隔一周入场一次
  优点是：如果后续市场逐步走低，那肯定好，可以逐步建仓，可惜市场无法预测
  缺点是：如果后续市场走高，那就踏空了，失去了好机会
  
  综上，要吸取经验教训，在数据支撑的情况下，要深刻理解低位加倍购买理念；并不是说 all in ,而是说机会到了，要抓住，
       至少要做到加倍购买，胆子大点。


#2022.0508
#为什么低位不买高位来追
#指数到底多少点，不是你该不该投资的关键。3000 点还是 3300，还是 4000，还是 5000，根本不重要。重要的是你买的东西贵不贵。

# 大盘涨跌 1000 点，自己手里股票涨跌 50% 的心理状态。如果发现手里股票跌 50% 会非常难受，那么你的仓位就重了。如果发现涨 50% 会因为少赚而难受，就说明现在手里股票太少。

人类能够识别的未来底部，极大概率只能是一个区域

什么是贪婪？ 很多人认为，高位不卖或者不停加码是贪。 没错，但是，还有一种贪，就是已经非常便宜的情况下，他还要等更便宜。 
他一分钱也不愿意多买，只希望自己买的更低，更低一点。 我不能说这种人一定是错，但他的风险与在顶部加码的人一样大。 
他们没有学会用概率的思维去思考问题，在他们的世界里，只有满仓——空仓，两个极致。

涨起来后没有「买满」，大多数是一种心理上的问题。 通常会是一种懊悔的情绪。 所以你要经常性的问自己，在这个位置，跌 x%，或者涨 x%，自己是否够舒服？ 
舒服就是合适，不舒服就调整到舒服。

美国标普500、沪深300、中证500、全指医药、全指消费、全指信息

2022.05.08
目前低估：养老产业，证券公司，恒生指数，中证红利
中估：上证50，沪深300，中证传媒，全指医药，全指环保，全指信息，创业板
高估：中证白酒

2022.05.11
不要怕，它不会死。坚持正确的投资策略，它一定会帮你赚钱。最黑暗的时候，一定要记起这句话

无论是大股票还是小股票的表现好，都只是历史长河中必然经历的周期轮回而已。无论是好还是不好，都不是永远，都只是一个过程。现在好的，未来未必会继续。 现在不好的，未来也许会凤凰涅槃。 
作为投资者，我们不要厚此薄彼，尤其在别人声音一致的时候。 别人不看好，我们更要留神和注意。 因为他们不看好，就一定因为是在低位。 你低位不留神，难道高位去跟他们一起抢吗？
只有小孩子才会做出选择，成年人只会说「我都要」。 所以我们都买。
我最喜欢的六个A股品种，几年前就已经跟大家说过了，分别是： 上证50、中证500、创业板、消费、医药、信息。
各位也可以看到，计划的仓位里，这些品种都有。 只是根据情况不同，买的时间有先后，持仓量有大小而已。
这就是体现之前说的，用估值、趋势、周期，决定仓位。 包括总的大类仓位和细分品种仓位。
A股的特点是暴涨暴跌。 所以一定要留意估值的重要性。 估值更多要用在「买入」上，而趋势则要更多用在「卖出」上。 因为便宜会有底，而疯狂起来，贵的会没边。 另外，研究经济周期，会让你的仓位配置会更有感觉。
上面每一句话都值 1000 万元，可以认真研究。


2022.05.13
「任何位置买入」或者「持有所有现金等大底」都是值得商榷的。
无它，概率尔。
这十几年投资指数，我有一个特别深刻的总结。那就是，如果你想要自己的成本低，千万不要在某个高位大量重复买入一个指数。这样，会让你未来的降低成本之路非常非常困难。
一个指数的估值是否进入过去十年最高 10% 区域，具有非常非常重要的意义。通常情况下，某个指数进入过去十年最高 10% 区域，就是本人清仓区域。
以2015年为例，医药、消费、沪深300、深证100、创业都是在五月进入该区域；环保、中小、全市场是四月进入该区域。一旦持有的指数进入这个死亡区域，速速离开是上策。

因为我觉得在上证、深证连续暴涨两年；中证500、中小板、创业板连涨 3 年；医药指数连涨 4 年的时候，新手的买入姿势只有一种：不买。
为啥呢，前面写过一个帖子《A股是个聚宝盆》，很明白，这种时候买，五年亏损的几率是 100%。当然历史不一定会完全重演，但这个历史数据已经很明显的表达了一个信号，连续大涨后你再来，就是买单而不是吃肉。
那么什么时候买？连跌两年的时候。那时候买，5 年年化（每年收益率）最高能到 45%，平均能有 30% 多！

卖出的原因，与2015.4 月份清仓 A 股一样：赚够了。留点钱给别人赚好吗？全世界的钱不可能让你一个人赚。即使「踏空」，那又如何？

投资的意义，是通过自己的智慧、判断、经验、意志，最终使自己财富越来越多的一种手段而已。
我不会与任何人比谁赚得更多，我只知道，我的资产比去年更多，这，也就够了。

没有人是神，谁也不会吃到每一个波段，买在每一个最低，卖在每一个最高。追求这些完美的人，都会以惨败告终。
而相信存在这些神话的人，也将为幼稚买单。

用A股几十年的历史数据，揭示了一个真相：只要你熊市入场，牛市出场，那么对你来说，A股就是一个聚宝盆。
年化收益率至少在十几个点以上

我坚信的一点就是，钻石底就是钻石底。也许未来会有意想不到的板块轮动、见底次序、底部持续时间、牛市涨幅和持续时间，
这一切都不能改变一个事实，那就是在钻石底大胆均衡买入指数基金，极大概率会在未来取得巨大的超额收益。

指数投资：有一种东西确实可以越跌越买，那就是指数。公司、行业会出这样那样的问题，指数只要你买在低位，未来一定会赚钱。
当公司风险、行业风险、管理层风险、产品风险全部没有的时候，你只剩下警惕的就是系统风险。
而我们的方法，就是在低位开始买入，越低买得越多。然后在估值高位卖出，越高卖得越多。
可以说，这样的思路没有任何风险（除非股市关门）。长期来看，我不信有任何投资人可以战胜这个理念。

「钻石底」是一个底部区域，不存在预测某个点是大底的情况。预测某个点是大底这件事，不是傻子就是骗子才会干。

咱们做投资，无论胜败，无论涨跌，内心都应该是平静如水，笑看风云。急、贪、惧都是失败的根源。这些，也还请各位好好再想想。

投资这个东西，本质还是一门低买高卖的生意。所谓三十年河东三十年河西

我心中的尺子是什么？
对于投资指数的我来说，目标指数的估值就是一把尺子。
低了就买，高了就卖。简简单单，风轻云淡。
低买高卖，说来简单又谈何容易？
最不容易的是等待。
不容易，更要做。这个世上，做成一件事，有容易的吗？

太阳下没有新鲜事。该跌就一定要跌，该涨也一定会涨。未来，你会看到，听到，越来越多的人说A股完了，
要推倒重来了，永远没希望了。这些话，一点都不新鲜，过去出现过，未来也一定会出现。
当所有人都在说的时候，你就该知道，你要变得富有了。

投资策略 三分支
https://youzhiyouxing.cn/materials/761

我一直告诉自己，投资，不是因为手里有钱，而是因为有好的投资机会

回看历史，我的每一次财富飞跃无一不是起步于大危机。随波逐流的操作最终只能是泯然众人。
希望我们还有幸能再碰到一次羊群旅鼠集体崩溃的时刻。

当你看清真相，自然不会恐惧。市场按照清晰的脉络不断起起伏伏。你会在冬天恐惧，害怕春天永远不会再来吗？
简直是笑话。

开开心心，踏踏实实。想象一下上涨 50%，下跌 30% 自己会不会舒服？会舒服就继续持有，不舒服就调整仓位到舒服为止。
一定要闭上眼睛想象一下 -30%～+50% 的场景，然后做出你的选择。


在这种时候，希望你还能记起之前我不断重复重复再重复的那些原则：
比如：
我们买的是指数，不会死；
我们买的不贵，长期看一定有不错的收益；
我们还有很多钱，可以摊低成本；
每次下跌对我们来说并非风险，而是非常好的买入便宜资产的机会；
我的数据体系和经验会尽量将我们所有持仓品种的成本控制在最低点的 10%～15%，熊市虽然收益看起来会一般，
但牛市来了一两周就可以扭亏为盈，然后开始资产飞跃……

在A股赚钱，说容易不容易，说难也不难。请你在最困难的时刻，想想你在做什么样的事情。
首先，你买的是指数，永远不会死。（99.99%）
其次，你并没有买在高点。我们买东西，都至少是从高点跌了一半才开始。
再次，有一套完善的投资系统、精确的数据支持、丰富的投资经验组成的完整体系支撑着所有的交易行为。

投资十三年，学习，总结并亲自用真金白银实践了不少投资策略。雪球高手云集，趋势策略不谈，只说价值策略，有四个经本人实践非常有效，同时简单易行。
这四个策略，不需要高瞻远瞩行业前景，不需要实地调研公司内幕，难度系数可以说只有 2.0。
它们分别是：定期不定额、价值网格、目标市值、定期动态再平衡。

https://youzhiyouxing.cn/materials/801


波动不必然是风险，波动也不可怕。当然，这是有前提的。前提是，你没有把所有资产买在波峰，卖在波谷。如果你这么做了，恐怕神仙也救不了你。

回看全年 150 的操作，完全做到知行合一：低位不怕，高位不贪。上涨的过程中拿得住，高位舍得卖，低位敢于买。


在不贵的地方，买入几个长期会好的指数基金，年化收益 10% 以上根本不是梦，而是事实。 A股是个聚宝盆。


无论是什么投资风格，我想对于价值投资来说，有几个点应该是有共识的：买的便宜（至少不贵），放弃预测中短期走势，对于优秀的品种长期持有直到非常贵。
至于有钱就买始终满仓还是动态平衡，又或者是其他什么，只是术上的区别而已。只要几个道的大原则不错，结局总不会错。
世界是多彩的，什么投资方法才是唯一好的？我看没有。不违反大原则，适合自己就是最好的。
至于我自己，还是喜欢趴在草丛中看着猎物慢慢走进我的最佳射击区的感觉。我要每天带着打到的猎物安全的回家，不让我儿子饿肚子甚至从小就没了爸爸，就这么简单 。

我跟大家说几个弹性巨大的品种，未来的牛市中可以当杠杆基金用的：券商、信息、军工。买的对就发了，买不对等着赔死吧。未来计划都会买，别急

