#!/bin/bash
# 为避免在文件夹生成太多目标文件，所以目标文件用 target_ 做前缀
## 1. 目前都是在招商银行上购买的基金

#python3 fund_data.py
cd LongInvest
#################### 国内基金 #############
echo "-------------- 国内基金 -------------"
# 大成中证红利指数A              090010
# 南方中证500ETF联接前段         160119
# 易方达沪深300ETF联接A          110020
g++ fund_090010.cpp -o target_090010
g++ fund_160119.cpp -o target_160119
g++ fund_110020.cpp -o target_110020
./target_090010 && ./target_160119 && ./target_110020

echo "-------------- 国内基金 -------------"
# 广发中证养老产业A               000968
# 广发中证全指信息技术ETF联接A     000942
# 广发中证传媒ETF联接C            004753
# 易方达中证全指证券公司指数A       502010
# 广发中证全指金融地产ETF联接A     001469
# 广发中证全指医药卫生ETF联接A     001180
g++ fund_000968.cpp -o target_000968
g++ fund_000942.cpp -o target_000942
g++ fund_004753.cpp -o target_004753
g++ fund_502010.cpp -o target_502010
g++ fund_001469.cpp -o target_001469
g++ fund_001180.cpp -o target_001180
./target_000968 && ./target_000942 && ./target_004753
./target_502010 && ./target_001469 && ./target_001180

#################### 美股基金 #############  
echo "-------------- 美股基金 -------------"
# 广发纳斯达克100QDll A类      270042
# 博时标普500ETF联接A类QDll    050025
g++ fund_270042.cpp -o target_270042
g++ fund_050025.cpp -o target_050025
./target_270042 && ./target_050025

#################### 港股基金 ############# 
echo "-------------- 港股基金 -------------"
# 华夏恒生ETF联接A(QDll)      000071
# 天弘恒生科技指数A            012348
g++ fund_000071.cpp -o target_000071
g++ fund_012348.cpp -o target_012348
./target_000071 && ./target_012348 

#################### 中概互联 #############
echo "-------------- 中概互联 -------------"
# 交银海外中国互联网指数     164906
g++ fund_164906.cpp -o target_164906
./target_164906


# 清空目标文件
rm -rf target_*
#rm -rf fund.txt

# 博时恒生医疗保健ETF联接A      014424
# 2023.1.4 清仓 收益 1115.61