#!/bin/bash
# 为避免在文件夹生成太多目标文件，所以目标文件用 target_ 做前缀
## 1. 目前都是在支付宝上购买的基金
#python3 fund_data.py
cd alipay

#################### 混合基金 #############
echo "-------------- 混合基金 -------------"
# 易方达蓝筹精选混合              005827
# 景顺长城新兴成长混合            260108
# 富国天惠成长混合A              161005
# 汇添富价值精选混合A            519069
# 兴全新视野灵活配置定期开放混合   001511
g++ fund_005827.cpp -o target_005827
g++ fund_260108.cpp -o target_260108
g++ fund_161005.cpp -o target_161005
g++ fund_519069.cpp -o target_519069
./target_005827 && ./target_260108
./target_161005 && ./target_519069

# 每次三个月定期,开放时看净值，其它时间没必要看
g++ fund_001511.cpp -o target_001511  
./target_001511

#################### 海外基金 #############
echo "-------------- 海外基金 -------------"
# 交银海外中国互联网指数     164906
# 易方达亚洲精选股票        118001
g++ fund_164906.cpp -o target_164906
g++ fund_118001.cpp -o target_118001
./target_164906 && ./target_118001

#################### 其他基金 #############
echo "-------------- 其他基金 -------------"
# 易方达上证50指数增强A        110003
# 工银瑞信前沿医疗股票A        001717
g++ fund_110003.cpp -o target_110003
g++ fund_001717.cpp -o target_001717
./target_110003 && ./target_001717


# 清空目标文件
rm -rf target_*
#rm -rf fund.txt