#include "../conf/wang_ge.h"

/*
 * 基金名称：华夏恒生ETF联接(QDll)C
 * 基金代码：006381
 * 购买渠道：支付宝
 * 用途：波段
*/

const std::string fund_name = "华夏恒生ETF联接(QDll)C";
const std::string fund_code = "006381";
const int total = 5;

Fund fund_array[total] = {
    {"01", "2022-02-25", 1000, 1.1909 },
    {"02", "2022-06-13", 2000, 1.1561 },
    {"03", "2022-06-29", 2000, 1.2073 },
    {"04", "2022-07-06", 1000, 1.1912 },
    {"05", "2022-07-11", 2000, 1.1645 },

};

// 买出数据结构
const int total_sell = 16;
// 次数,买入时间,买入金额,买入净值,卖出时间,卖出净值
FundSell fund_sell_array[total_sell] = {
    {"01", "2022-03-15", 1000, 0.9747, "2022-03-17", 1.1216 },
    {"02", "2022-03-07", 1000, 1.1061, "2022-03-23", 1.1547 },
    {"03", "2022-04-25", 1100, 1.0580, "2022-04-29", 1.1399 },
    {"04", "2022-05-12", 1500, 1.0669, "2022-05-17", 1.1388 },
    {"05", "2022-05-06", 1200, 1.0854, "2022-05-30", 1.1536 },

    {"06", "2022-05-24", 1500, 1.0952, "2022-05-30", 1.1536 },
    {"07", "2022-03-25", 1050, 1.1208, "2022-06-24", 1.1885 },
    {"08", "2022-10-24", 1000, 0.8978, "2022-11-04", 0.9668 },
    {"09", "2022-10-20", 2000, 0.9604, "2022-11-14", 1.0291 },
    {"10", "2022-09-30", 2000, 1.0111, "2022-11-15", 1.0624 },

    {"11", "2022-09-22", 2000, 1.0488, "2022-12-01", 1.1002 },
    // 2023
    {"12", "2022-09-14", 3000, 1.0785, "2023-01-03", 1.1492 },
    {"13", "2022-08-10", 3000, 1.0935, "2023-01-04", 1.1782 },
    {"14", "2022-08-02", 5000, 1.0954, "2023-01-05", 1.1889 },
    {"15", "2022-09-01", 3000, 1.1123, "2023-01-09", 1.1969 },
    {"16", "2022-07-29", 2000, 1.1199, "2023-01-11", 1.1907 },
};


int main() {
  cout << "\n" << fund_name << "\n";
  unordered_map<std::string, std::pair<std::string, double> > fund_info = get_fund_info();
  if (fund_info.find(fund_code) == fund_info.end()) {
    return 0;
  }
  std::pair<std::string, double> tmp = fund_info[fund_code];
  std::string current_date = tmp.first;
  double current_jingzhi = tmp.second;
  buy_function(fund_array, total, current_jingzhi, current_date);

  // 卖出函数
  if (detail_switch) {
    sell_function(fund_sell_array, total_sell);
  }
}