#include "../tools/util.h"

// true=波段详情打开；false=关闭
bool detail_switch = false;

// #################### 混合基金 #############
// 005827   易方达蓝筹精选混合             
// 260108   景顺长城新兴成长混合           
// 161005   富国天惠成长混合A             
// 519069   汇添富价值精选混合A            

// #################### 海外基金 #############
// 164906   交银海外中国互联网指数        
// 118001   易方达亚洲精选股票           

// #################### 其他基金 #############
// 110003   易方达上证50指数增强A        
// 001717   工银瑞信前沿医疗股票A        


// 三个月定期
// 001511   兴全新视野灵活配置定期开放混合 



// 1.18 日操作
// -- 卖出 1k 交银海外中国互联网指数
// -- 卖出 1k 易方达亚洲精选股票