#include "../tools/util.h"

// true=波段详情打开；false=关闭
bool detail_switch = false;
//bool detail_switch = true;

// #################### 国内基金 #############
// 090010    大成中证红利指数A               
// 160119    南方中证500ETF联接A            
// 110020    易方达沪深300ETF联接A          

// #################### 行业基金 #############
// 000968    广发中证养老产业A               
// 000942    广发中证全指信息技术ETF联接A     
// 004753    广发中证传媒ETF联接C            
// 502010    易方达中证全指证券公司指数A       
// 001469    广发中证全指金融地产ETF联接A     
// 001180    广发中证全指医药卫生ETF联接A     

//#################### 美股基金 #############  
// 270042    广发纳斯达克100指数A(QDll)    
// 050025    博时标普500ETF联接A类(QDll)   

// #################### 港股基金 ############# 
// 000071    华夏恒生ETF联接A(QDll)       
// 012348    天弘恒生科技指数A             
// 014424    博时恒生医疗保健ETF联接A      

// #################### 中概互联 #############
// 164906    交银海外中国互联网指数      



// 




