#include "../tools/util.h"

// true=波段详情打开；false=关闭
bool detail_switch = false;
//bool detail_switch = true;

// -----------------------------------------------
// 006381   华夏恒生ETF联接(QDll)C 
// 012349   天弘恒生科技指数(QDLL)C     
// 004753   广发中证传媒ETF联接C       

// -------- ---------------------------------------
// 002978   广发中证全指医药卫生ETF联接C 
// 012874   易方达中证全指证券公司指数C
// 002974   广发信息技术联接C

// -----------------------------------------------
// 004744   易方达创业板ETF联接C
// 002982   广发中证养老产业C

// 006479   广发纳斯达克100C


// ----------------- 清仓  ------------------------
// 002979   广发金融地产指数C
// 012414   招商中证白酒指数C


// 
