#include "../conf/alipay.h"

/*
 * 基金名称：富国天惠成长混合A
 * 基金代码：161005
 * 购买渠道：支付宝
 * 用途：尽快卖掉
*/

const std::string fund_name = "富国天惠成长混合A";
const std::string fund_code = "161005";

const int total = 3;
// 次数,日期,金额,净值
Fund fund_array[total] = {
    /*{"01", "2021-07-06",  300, 3.5580 },
    {"02", "2021-07-23",  200, 3.6154 },
    {"03", "2021-07-26",  200, 3.5143 },
    {"04", "2021-07-27",  200, 3.3853 },
    {"05", "2021-07-28",  200, 3.3947 },

    {"06", "2021-07-29",  100, 3.4717 },
    {"07", "2021-07-30",  200, 3.4325 },
    {"08", "2021-08-17",  100, 3.4152 },
    {"09", "2021-08-18",  100, 3.4405 },
    {"10", "2021-08-19",  100, 3.4316 },

    {"11", "2021-08-20",  200, 3.3868 },
    {"12", "2021-09-15",  200, 3.3270 },
    {"13", "2021-09-16",  100, 3.2846 },
    {"14", "2021-09-22",  100, 3.3131 },
    {"15", "2021-10-12",  100, 3.3465 },

    {"16", "2021-10-18",  100, 3.3612 },
    {"17", "2021-10-28",  100, 3.3591 },
    {"18", "2021-11-02",  100, 3.3854 },
    {"19", "2021-11-10",  100, 3.3718 },
    {"20", "2022-01-05",  100, 3.3979 },

    {"21", "2022-01-06",  100, 3.3712 },*/
    {"22", "2022-01-25",  100, 3.2650 },
    {"23", "2022-08-24", 1000, 2.8444 },
    {"24", "2022-10-19", 1000, 2.6289 },
};


// 买出数据结构
const int total_sell = 3;
// 次数,买入时间,买入金额,买入净值,卖出时间,卖出净值
FundSell fund_sell_array[total_sell] = {
    { "01", "2022-04-25", 500, 2.5450, "2022-08-12", 2.9382 },
    { "02", "2022-03-15", 500, 2.6702, "2022-08-22", 2.9304 },
    { "03", "2022-03-28", 500, 2.7901, "2022-08-22", 2.9304 },
};


int main() {
  cout << "\n" << fund_name << "\n";
  unordered_map<std::string, std::pair<std::string, double> > fund_info = get_fund_info();
  if (fund_info.find(fund_code) == fund_info.end()) {
    return 0;
  }
  std::pair<std::string, double> tmp = fund_info[fund_code];
  std::string current_date = tmp.first;
  double current_jingzhi = tmp.second;
  buy_function(fund_array, total, current_jingzhi, current_date);
  
  // 卖出函数
  if (detail_switch) {
    sell_function(fund_sell_array, total_sell);
  }
  
}